main_menu = '''Главное меню:
        1. Открыть файл
        2. Сохранить файл
        3. Показать все контакты
        4. Создать контакт
        5. Найти контакт
        6. Изменить контакт
        7. Удалить контакт
        8. Русский Язык
        9. english
        10. Выход'''

choose_menu = "Выберите пункт меню: "
no_contact_or_file = "Телефонная книга пуста или не открыта."
no_serach_result = "Извините, ничего не найдено"
only_int = "Введите целое число"

load_successful = 'Телефонная книга успешно загружена.'
save_successful = 'Телефонная книга успешно сохранена.'

new_contact_successful = 'Контакт успешно создан.'
change_successful = "Контакт успешно изменен"
change_unsuccessful = "Ошибка изменения контакта"
del_successful = "Контакт успешно удален"
del_unsuccessful = "ошибка удаления контакта"

new_name = 'Введите имя и фамилию контакта:'
new_phone = 'Введите телефон контакта: '
new_comment = 'Введите комментарий к контакту:'

seraching_contact = "поиск контакта:(пустая строка = любое значение!)"
changing_contact = "Изменение контакта:(пустая строка = любое значение!)"
deleting_contact = "удаление контакта(пустая строка = любое значение!)"

is_changed = 'Были внесены изменения. Сохранить?'

bye_bye = 'До свидания! Всего хорошего!'

matches_on = "Есть совпадения по: "

# блок поиска - есть совпадение по:
name = "Имени пользователя"  
phone = "Телефонному номеру"
comment = "Комментарию"

name_to_edit = "Наберите номер контакта для редактирования: "
name_to_del = "Наберите номер контакта для удаления: "